using System.Collections.Generic;

namespace Krista.FM.Server.Dashboards.reports.SGM
{
    public class SGMRegionNamer
    {
        public Dictionary<string, string> sgmDictionary1 = new Dictionary<string, string>();
        public Dictionary<string, string> sgmDictionary2 = new Dictionary<string, string>();

        public Dictionary<string, string> sgmDeseaseDictionary1 = new Dictionary<string, string>();
        public Dictionary<string, string> sgmDeseaseDictionary2 = new Dictionary<string, string>();

        public bool isSubjectReport = false;

        public void FillSGMRegionsDictionary1()
        {
            sgmDictionary1 = new Dictionary<string, string>();
            sgmDictionary1.Clear();

            if (!isSubjectReport)
            {
                sgmDictionary1.Add("РОССИЙСКАЯ ФЕДЕРАЦ. ", "в Российской  Федерации");

                sgmDictionary1.Add("ЦЕНТРАЛЬНЫЙ ФЕД.ОКР.", "в Центральном федеральном округе");
                sgmDictionary1.Add("Белгородская обл    ", "в Белгородской области");
                sgmDictionary1.Add("Брянская область    ", "в Брянской области");
                sgmDictionary1.Add("Владимирская обл    ", "во Владимирской области");
                sgmDictionary1.Add("Воронежская обл.    ", "в Воронежской области");
                sgmDictionary1.Add("г.Москва            ", "в г.Москва");
                sgmDictionary1.Add("Ивановская обл.     ", "в Ивановской области");
                sgmDictionary1.Add("Калужская обл.      ", "в Калужской области");
                sgmDictionary1.Add("Костромская обл.    ", "в Костромской области");
                sgmDictionary1.Add("Курская область     ", "в Курской области");
                sgmDictionary1.Add("Липецкая область    ", "в Липецкой области");
                sgmDictionary1.Add("Московская обл.     ", "в Московской области");
                sgmDictionary1.Add("Орловская обл.      ", "в Орловской области");
                sgmDictionary1.Add("Рязанская обл.      ", "в Рязанской области");
                sgmDictionary1.Add("Смоленская обл.     ", "в Смоленской области");
                sgmDictionary1.Add("Тверская область    ", "в Тверской области");
                sgmDictionary1.Add("Тульская область    ", "в Тульской области");
                sgmDictionary1.Add("Ярославская обл.    ", "в Ярославской области");
                sgmDictionary1.Add("Тамбовская обл.     ", "в Тамбовской области");

                sgmDictionary1.Add("УРАЛЬСКИЙ ФЕД.ОКРУГ ", "в Уральском федеральном округе");
                sgmDictionary1.Add("Курганская обл.     ", "в Курганской области");
                sgmDictionary1.Add("Свердловская обл    ", "в Свердловской области");
                sgmDictionary1.Add("Тюменская обл.      ", "в Тюменской области");
                sgmDictionary1.Add("Ханты-МансийскАО    ", "в Ханты-Мансийском автономном округе");
                sgmDictionary1.Add("Ямало-НенецкийАО    ", "в Ямало-Ненецком автономном округе");
                sgmDictionary1.Add("Челябинская обл.    ", "в Челябинской области");

                sgmDictionary1.Add("ДАЛЬНЕВОСТ.ФЕД.ОКРУГ", "в Дальневосточном федеральном округе");
                sgmDictionary1.Add("Амурская область    ", "в Амурской области");
                sgmDictionary1.Add("Еврейская АО        ", "в Еврейской автономной области");
                sgmDictionary1.Add("Камчатская обл.     ", "в Камчатской области");
                sgmDictionary1.Add("Камчатский край     ", "в Камчатском крае");
                sgmDictionary1.Add("Корякский АО        ", "в Корякском автономном округе");
                sgmDictionary1.Add("Магаданская обл.    ", "в Магаданской области");
                sgmDictionary1.Add("Приморский край     ", "в Приморском крае");
                sgmDictionary1.Add("Республика Саха     ", "в Республике Саха (Якутия)");
                sgmDictionary1.Add("Сахалинская обл.    ", "в Сахалинской области");
                sgmDictionary1.Add("Хабаровский край    ", "в Хабаровском крае");
                sgmDictionary1.Add("Чукотский АО        ", "в Чукотском автономном округе");

                sgmDictionary1.Add("СИБИРСКИЙ ФЕД.ОКРУГ ", "в Сибирском федеральном округе");
                sgmDictionary1.Add("Агин.БурятскийАО    ", "в Агин.Бурятском автономном округе");
                sgmDictionary1.Add("Алтайский край      ", "в Алтайском крае");
                sgmDictionary1.Add("Забайкальский край  ", "в Забайкальском крае");
                sgmDictionary1.Add("Иркутская обл.      ", "в Иркутской области");
                sgmDictionary1.Add("Кемеровская обл.    ", "в Кемеровской области");
                sgmDictionary1.Add("Красноярский кр.    ", "в Красноярском крае");
                sgmDictionary1.Add("Новосибирская об    ", "в Новосибирской области");
                sgmDictionary1.Add("Омская область      ", "в Омской области");
                sgmDictionary1.Add("Республика Алтай    ", "в Республике Алтай");
                sgmDictionary1.Add("Респ.Бурятия        ", "в Республике Бурятия");
                sgmDictionary1.Add("Республика Тыва     ", "в Республике Тыва");
                sgmDictionary1.Add("Респ.Хакасия        ", "в Республике Хакасия");
                sgmDictionary1.Add("Таймырский АО       ", "в Таймырском автономном округе");
                sgmDictionary1.Add("Томская область     ", "в Томской области");
                sgmDictionary1.Add("Усть-Орд-БурятАО    ", "в Усть-Ордынском Бурятском автономном округе");
                sgmDictionary1.Add("Читинская обл.      ", "в Читинской области");
                sgmDictionary1.Add("Эвенкийский АО      ", "в Эвенкийском автономном округе");

                sgmDictionary1.Add("СЕВЕРО-ЗАПАДНЫЙ ФО  ", "в Северо-Западном федеральном округе");
                sgmDictionary1.Add("Архангельская обл.  ", "в Архангельской области");
                sgmDictionary1.Add("Вологодская область ", "в Вологодской области");
                sgmDictionary1.Add("Санкт-Петербург     ", "в г. Санкт-Петербург");
                sgmDictionary1.Add("Калининград.обл.    ", "в Калининградской области");
                sgmDictionary1.Add("Ленинградская обл.  ", "в Ленинградской области");
                sgmDictionary1.Add("Мурманская область  ", "в Мурманской области");
                sgmDictionary1.Add("Ненецкий авт.окр    ", "в Ненецком автономном округе");
                sgmDictionary1.Add("Новгородская обл    ", "в Новгородской области");
                sgmDictionary1.Add("Псковская область   ", "в Псковской области");
                sgmDictionary1.Add("Республика Карелия  ", "в Республике Карелия");
                sgmDictionary1.Add("Республика Коми     ", "в Республике Коми");

                sgmDictionary1.Add("ЮЖНЫЙ ФЕД. ОКР      ", "в Южном федеральном округе");
                sgmDictionary1.Add("Астраханская обл    ", "в Астраханской области");
                sgmDictionary1.Add("Волгоградская об    ", "в Волгоградской области");
                sgmDictionary1.Add("Кабард.-Балкар.Респ.", "в Кабардино-Балкарской Республике");
                sgmDictionary1.Add("Карач.-Черк.Респ    ", "в Карачаево-Черкесской Республике");
                sgmDictionary1.Add("Краснодарский кр    ", "в Краснодарском крае");
                sgmDictionary1.Add("Респ.Адыгея         ", "в Республике Адыгея");
                sgmDictionary1.Add("Респ.Дагестан       ", "в Республике Дагестан");
                sgmDictionary1.Add("Респ.Ингушетия      ", "в Республике Ингушетия");
                sgmDictionary1.Add("Респ.Калмыкия       ", "в Республике Калмыкия");
                sgmDictionary1.Add("Респ.Сев.-Осетия    ", "в Республике Северная Осетия-Алания");
                sgmDictionary1.Add("Ростовская обл.     ", "в Ростовской области");
                sgmDictionary1.Add("Ставропольск.кр.    ", "в Ставропольском крае");
                sgmDictionary1.Add("Чеченская Респ.     ", "в Чеченской республике");

                sgmDictionary1.Add("ПРИВОЛЖСКИЙ ФЕД.ОКР.", "в Приволжском федеральном округе");
                sgmDictionary1.Add("Кировская обл.      ", "в Кировской области");
                sgmDictionary1.Add("Коми-ПермяцкийАО    ", "в Коми-Пермяцком автономном округе");
                sgmDictionary1.Add("Нижегородская об    ", "в Нижегородской области");
                sgmDictionary1.Add("Оренбургская обл    ", "в Оренбургской области");
                sgmDictionary1.Add("Пензенская обл.     ", "в Пензенской области");
                sgmDictionary1.Add("Пермская область    ", "в Пермской области");
                sgmDictionary1.Add("Пермский край       ", "в Пермском крае");
                sgmDictionary1.Add("Рес.Башкортостан    ", "в Республике Башкортостан");
                sgmDictionary1.Add("Респ.Марий Эл       ", "в Республике Марий Эл");
                sgmDictionary1.Add("Респ.Мордовия       ", "в Республике Мордовия");
                sgmDictionary1.Add("Респ.Татарстан      ", "в Республике Татарстан");
                sgmDictionary1.Add("Самарская обл.      ", "в Самарской области");
                sgmDictionary1.Add("Саратовская обл.    ", "в Саратовской области");
                sgmDictionary1.Add("Удмуртская Респ.    ", "в Удмуртской республике");
                sgmDictionary1.Add("Ульяновская обл.    ", "в Ульяновской области");
                sgmDictionary1.Add("Чувашская Респ.     ", "в Чувашской республике");

                sgmDictionary1.Add("СЕВЕРО-КАВКАЗСКИЙ ФО", "в Северо-Кавказском федеральном округе");
            }
            else
            {
                sgmDictionary1.Add("Кабардино-Балк. Респ", "в Кабардино-Балкарской Республике");
                sgmDictionary1.Add("г. Баксан           ", "в городе Баксан");
                sgmDictionary1.Add("Баксанский район    ", "в Баксанcком районе");
                sgmDictionary1.Add("Зольский район      ", "в Зольском районе");
                sgmDictionary1.Add("Лескенский район    ", "в Лескенском районе");
                sgmDictionary1.Add("Майский район       ", "в Майском районе");
                sgmDictionary1.Add("г. Прохладный       ", "в городе Прохладный");
                sgmDictionary1.Add("Прохладненский район", "в Прохладненском районе");
                sgmDictionary1.Add("Терский район       ", "в Терском районе");
                sgmDictionary1.Add("Урванский район     ", "в Урванском районе");
                sgmDictionary1.Add("Чегемский район     ", "в Чегемском районе");
                sgmDictionary1.Add("Черекский район     ", "в Черекском районе");
                sgmDictionary1.Add("Эльбрусский район   ", "в Эльбрусском районе");
                sgmDictionary1.Add("г. Нальчик          ", "в городе Нальчик");
                sgmDictionary1.Add("Прохладненское ТО   ", "в Прохладненском территориальном образовании");
                sgmDictionary1.Add("Баксанское ТО       ", "в Баксанском территориальном образовании");
                sgmDictionary1.Add("Урванское ТО        ", "в Урванском территориальном образовании");
            }
        }

        public void FillSGMRegionsDictionary2()
        {
            sgmDictionary2 = new Dictionary<string, string>();
            sgmDictionary2.Clear();
            if (isSubjectReport)
            {
                sgmDictionary2.Add("РОССИЙСКАЯ ФЕДЕРАЦ. ", "по Российской  Федерации");
                sgmDictionary2.Add("ЦЕНТРАЛЬНЫЙ ФЕД.ОКР.", "по Центральному федеральному округу");
                sgmDictionary2.Add("УРАЛЬСКИЙ ФЕД.ОКРУГ ", "по Уральскому федеральному округу");
                sgmDictionary2.Add("ДАЛЬНЕВОСТ.ФЕД.ОКРУГ", "по Дальневосточному федеральному округу");
                sgmDictionary2.Add("СИБИРСКИЙ ФЕД.ОКРУГ ", "по Сибирскому федеральному округу");
                sgmDictionary2.Add("СЕВЕРО-ЗАПАДНЫЙ ФО  ", "по Северо-Западному федеральному округу");
                sgmDictionary2.Add("ЮЖНЫЙ ФЕД. ОКР      ", "по Южному федеральному округу");
                sgmDictionary2.Add("ПРИВОЛЖСКИЙ ФЕД.ОКР.", "по Приволжскому федеральному округу");

                sgmDictionary2.Add("СЕВЕРО-КАВКАЗСКИЙ ФО", "по Северо-Кавказскому федеральному округу");
            }
            else
            {
                sgmDictionary2.Add("Кабардино-Балк. Респ", "по Кабардино-Балкарской Республике");
                sgmDictionary2.Add("Прохладненское ТО   ", "по Прохладненскому территориальному образованию");
                sgmDictionary2.Add("Баксанское ТО       ", "по Баксанскому территориальному образованию");
                sgmDictionary2.Add("Урванское ТО        ", "по Урванскому территориальному образованию");
            }
        }

        public void FillSGMDeseasesDictionary1()
        {
            sgmDeseaseDictionary1 = new Dictionary<string, string>();
            sgmDeseaseDictionary1.Clear();

            sgmDeseaseDictionary1.Add("Брюшной тиф", "Брюшным тифом");
            sgmDeseaseDictionary1.Add("Паратифы А, В, С  и неуточненный", "Паратифами А, В, С  и неуточненным");
            sgmDeseaseDictionary1.Add("Бактерионосители брюшного тифа, паратифов", "Бактерионосителями брюшного тифа, паратифов");
            sgmDeseaseDictionary1.Add("Холера", "Холерой");
            sgmDeseaseDictionary1.Add("Вибриононосители холеры", "Вибриононосителями холеры");
            sgmDeseaseDictionary1.Add("Другие сальмонеллезные инфекции", "Другими сальмонеллезными инфекциями");
            sgmDeseaseDictionary1.Add("Сальмонеллезные инфекции группы В", "Сальмонеллезными инфекциями группы В");
            sgmDeseaseDictionary1.Add("Сальмонеллезные инфекции группы С", "Сальмонеллезными инфекциями группы С");
            sgmDeseaseDictionary1.Add("Сальмонеллезные инфекции группы Д", "Сальмонеллезными инфекциями группы Д");
            sgmDeseaseDictionary1.Add("Бактериальная дизентерия (шигеллез)", "Бактериальной дизентерией (шигеллез)");
            sgmDeseaseDictionary1.Add("Дизентерия бактериологически подтвержденная", "Дизентерией бактериологически подтвержденной");
            sgmDeseaseDictionary1.Add("Дизентерия, вызванная шигеллами Зонне", "Дизентерией, вызванной шигеллами Зонне");
            sgmDeseaseDictionary1.Add("Дизентерия, вызванная шигеллами Флекснера", "Дизентерией, вызванной шигеллами Флекснера");
            sgmDeseaseDictionary1.Add("Бактерионосители дизентерии", "Бактерионосителями дизентерии");
            sgmDeseaseDictionary1.Add("Другие острые кишечные инфекции, вызванные установленными бактериальными, вирусными возбудителями, а также пищевые токсикоинфекции установленной этиологии", "Другими острыми кишечными инфекциями, вызванными установленными бактериальными, вирусными возбудителями, а также пищевыми токсикоинфекциями установленной этиологии");
            sgmDeseaseDictionary1.Add("Острые кишечные инфекции, вызванные ротавирусами", "Острыми кишечными инфекциями, вызванными ротавирусами");
            sgmDeseaseDictionary1.Add("Острые кишечные инфекции, вызванные кампилобактериями", "Острыми кишечными инфекциями, вызванными кампилобактериями");
            sgmDeseaseDictionary1.Add("Острые кишечные инфекции, вызванные энтеропатогенными кишечными палочками", "Острыми кишечными инфекциями, вызванными энтеропатогенными кишечными палочками");
            sgmDeseaseDictionary1.Add("Острые кишечные инфекции, вызванные иерсиниями энтероколитика", "Острыми кишечными инфекциями, вызванными иерсиниями энтероколитика");
            sgmDeseaseDictionary1.Add("Острые кишечные инфекции, вызванные неустановленными инфекционными возбудителями, пищевые токсикоинфекции неустановленной этиологии", "Острыми кишечными инфекциями, вызванными неустановленными инфекционными возбудителями, пищевыми токсикоинфекциями неустановленной этиологии");
            sgmDeseaseDictionary1.Add("Острые вирусные гепатиты всего", "Острыми вирусными гепатитами всего");
            sgmDeseaseDictionary1.Add("Острый гепатит А", "Острым гепатитом А");
            sgmDeseaseDictionary1.Add("Острый гепатит В", "Острым гепатитом В");
            sgmDeseaseDictionary1.Add("Острый гепатит С", "Острым гепатитом С");
            sgmDeseaseDictionary1.Add("Хронические вирусные гепатиты (впервые установленные)", "Хроническими вирусными гепатитами (впервые установленными)");
            sgmDeseaseDictionary1.Add("Хронический  вирусный гепатит В", "Хроническим  вирусным гепатитом В");
            sgmDeseaseDictionary1.Add("Хронический вирусный гепатит С", "Хроническим вирусным гепатитом С");
            sgmDeseaseDictionary1.Add("Носительство возбудителя вирусного гепатита В", "Носительством возбудителя вирусного гепатита В");
            sgmDeseaseDictionary1.Add("Носительство возбудителя вирусного гепатита С", "Носительством возбудителя вирусного гепатита С");
            sgmDeseaseDictionary1.Add("Острый паралитический полиомиелит", "Острым паралитическим полиомиелитом");
            sgmDeseaseDictionary1.Add("Острый паралитический полиомиелит, вызванный диким вирусом", "Острым паралитическим полиомиелитом, вызванный диким вирусом");
            sgmDeseaseDictionary1.Add("Острый паралитический полиомиелит другой и неуточненный", "Острым паралитическим полиомиелитом другим и неуточненным");
            sgmDeseaseDictionary1.Add("Острый паралитический полиомиелит, ассоциированный с вакциной", "Острым паралитическим полиомиелитом, ассоциированным с вакциной");
            sgmDeseaseDictionary1.Add("Острые вялые параличи", "Острым вялым параличом");
            sgmDeseaseDictionary1.Add("Дифтерия", "Дифтерией");
            sgmDeseaseDictionary1.Add("Бактерионосители токсигенных штаммов дифтерии", "Бактерионосителями токсигенных штаммов дифтерии");
            sgmDeseaseDictionary1.Add("Коклюш", "Коклюшем");
            sgmDeseaseDictionary1.Add("Коклюш, вызванный Bordetella parapertussis", "Коклюшем, вызванным Bordetella parapertussis");
            sgmDeseaseDictionary1.Add("Скарлатина", "Скарлатиной");
            sgmDeseaseDictionary1.Add("Ветряная оспа", "Ветряной оспой");
            sgmDeseaseDictionary1.Add("Корь", "Корью");
            sgmDeseaseDictionary1.Add("Краснуха", "Краснухой");
            sgmDeseaseDictionary1.Add("Синдром врожденной краснухи (СВК)", "Синдромом врожденной краснухи (СВК)");
            sgmDeseaseDictionary1.Add("Паротит эпидемический", "Паротитом эпидемическим");
            sgmDeseaseDictionary1.Add("Менингококковая инфекция", "Менингококковой инфекцией");
            sgmDeseaseDictionary1.Add("Менингококковая инфекция, генерализованные формы", "Менингококковой инфекцией, генерализованной формы");
            sgmDeseaseDictionary1.Add("Столбняк", "Столбняком");
            sgmDeseaseDictionary1.Add("Туляремия", "Туляремией");
            sgmDeseaseDictionary1.Add("Сибирская язва", "Сибирской язвой");
            sgmDeseaseDictionary1.Add("Бруцеллез, впервые выявленный", "Бруцеллезом, впервые выявленным");
            sgmDeseaseDictionary1.Add("Геморрагические лихорадки", "Геморрагической лихорадкой");
            sgmDeseaseDictionary1.Add("Геморрагические лихорадки с почечным синдромом", "Геморрагической лихорадкой с почечным синдромом");
            sgmDeseaseDictionary1.Add("Клещевой вирусный  энцефалит", "Клещевым вирусным  энцефалитом");
            sgmDeseaseDictionary1.Add("Клещевой боррелиоз (болезнь Лайма)", "Клещевым боррелиозом (болезнь Лайма)");
            sgmDeseaseDictionary1.Add("Псевдотуберкулез", "Псевдотуберкулезом");
            sgmDeseaseDictionary1.Add("Лептоспироз", "Лептоспирозом");
            sgmDeseaseDictionary1.Add("Бешенство", "Бешенством");
            sgmDeseaseDictionary1.Add("Укусы, ослюнения, оцарапывания животными", "Укусами, ослюнениями, оцарапываниями животными");
            sgmDeseaseDictionary1.Add("Укусы, ослюнения, оцарапывания  дикими животными", "Укусами, ослюнениями, оцарапываниями  дикими животными");
            sgmDeseaseDictionary1.Add("Орнитоз (пситтакоз)", "Орнитозом (пситтакоз)");
            sgmDeseaseDictionary1.Add("Риккетсиозы", "Риккетсиозами");
            sgmDeseaseDictionary1.Add("Эпидемический сыпной тиф", "Эпидемическим сыпным тифом");
            sgmDeseaseDictionary1.Add("Болезнь Брилля", "Болезнью Брилля");
            sgmDeseaseDictionary1.Add("Лихорадка Ку", "Лихорадкой Ку");
            sgmDeseaseDictionary1.Add("Сибирский клещевой тиф", "Сибирским клещевым тифом");
            sgmDeseaseDictionary1.Add("Педикулез", "Педикулезом");
            sgmDeseaseDictionary1.Add("Листериоз", "Листериозом");
            sgmDeseaseDictionary1.Add("Легионеллез", "Легионеллезом");
            sgmDeseaseDictionary1.Add("Инфекционный мононуклеоз", "Инфекционным мононуклеозом");
            sgmDeseaseDictionary1.Add("Туберкулез (впервые выявленный) активные формы", "Туберкулезом (впервые выявленным) активной формы");
            sgmDeseaseDictionary1.Add("Туберкулез органов дыхания", "Туберкулезом органов дыхания");
            sgmDeseaseDictionary1.Add("Туберкудез бациллярные формы", "Туберкудезом бациллярной формы");
            sgmDeseaseDictionary1.Add("Сифилис (впервые выявленный) все формы", "Сифилисом (впервые выявленным) всех форм");
            sgmDeseaseDictionary1.Add("Гонококковая  инфекция", "Гонококковой  инфекцией");
            sgmDeseaseDictionary1.Add("Болезнь, вызванная вирусом иммуннодефицита человека", "Болезнью, вызванной вирусом иммуннодефицита человека");
            sgmDeseaseDictionary1.Add("Острые инфекции верхних дыхательных путей множественной или неуточненной локализации", "Острыми инфекциями верхних дыхательных путей множественной или неуточненной локализации");
            sgmDeseaseDictionary1.Add("Грипп", "Гриппом");
            sgmDeseaseDictionary1.Add("Цитомегаловирусная инфекция", "Цитомегаловирусными инфекциями");
            sgmDeseaseDictionary1.Add("Пневмоцистоз", "Пневмоцистозом");
            sgmDeseaseDictionary1.Add("Микроспория", "Микроспорией");
            sgmDeseaseDictionary1.Add("Чесотка", "Чесоткой");
            sgmDeseaseDictionary1.Add("Трихофития", "Трихофитией");
            sgmDeseaseDictionary1.Add("Малярия впервые выявленная", "Малярией впервые выявленной");
            sgmDeseaseDictionary1.Add("Паразитоносители малярии", "Паразитоносителями малярии");
            sgmDeseaseDictionary1.Add("Поствакцинальные осложнения", "Поствакцинальными осложнениями");
            sgmDeseaseDictionary1.Add("Лямблиоз", "Лямблиозом");
            sgmDeseaseDictionary1.Add("Токсоплазмоз", "Токсоплазмозом");
            sgmDeseaseDictionary1.Add("Другие протозойные болезни", "Другими протозойными болезнями");
            sgmDeseaseDictionary1.Add("Аскаридоз", "Аскаридозом");
            sgmDeseaseDictionary1.Add("Трихоцефалез", "Трихоцефалезом");
            sgmDeseaseDictionary1.Add("Энтеробиоз", "Энтеробиозом");
            sgmDeseaseDictionary1.Add("Трихинеллез", "Трихинеллезом");
            sgmDeseaseDictionary1.Add("Токсокароз", "Токсокарозом");
            sgmDeseaseDictionary1.Add("Тениаринхоз", "Тениаринхозом");
            sgmDeseaseDictionary1.Add("Тениоз", "Тениозом");
            sgmDeseaseDictionary1.Add("Гименолепидоз", "Гименолепидозом");
            sgmDeseaseDictionary1.Add("Дифиллоботриоз", "Дифиллоботриозом");
            sgmDeseaseDictionary1.Add("Эхиноккоз", "Эхиноккозом");
            sgmDeseaseDictionary1.Add("Описторхоз", "Описторхозом");
            sgmDeseaseDictionary1.Add("Другие гельминтозы", "Другими гельминтозами");
            sgmDeseaseDictionary1.Add("Гнойно-септические инфекции новорожденных", "Гнойно-септическими инфекциями новорожденных");
            sgmDeseaseDictionary1.Add("Бактериальный менингит", "Бактериальным менингитом");
            sgmDeseaseDictionary1.Add("Сепсис", "Сепсисом");
            sgmDeseaseDictionary1.Add("Остеомиелит", "Остеомиелитом");
            sgmDeseaseDictionary1.Add("Отит", "Отитом");
            sgmDeseaseDictionary1.Add("Омфалит, флебит пупочной вены", "Омфалитом, флебитом пупочной вены");
            sgmDeseaseDictionary1.Add("Пиодермия, импетиго, мастит, панариций, паранихий", "Пиодермией, импетиго, маститом, панарицием, паранихинием");
            sgmDeseaseDictionary1.Add("Конъюнктивит", "Конъюнктивитом");
            sgmDeseaseDictionary1.Add("Гнойно-септические инфекции родильниц", "Гнойно-септическими инфекциями родильниц");
            sgmDeseaseDictionary1.Add("Мастит", "Маститом");
            sgmDeseaseDictionary1.Add("Послеоперационные инфекции", "Послеоперационными инфекциями");
            sgmDeseaseDictionary1.Add("Постинъекционные инфекции", "Постинъекционными инфекциями");
            sgmDeseaseDictionary1.Add("Инфекции мочевыводящих путей", "Инфекциями мочевыводящих путей");
            sgmDeseaseDictionary1.Add("Острые кишечные инфекции", "Острыми кишечными инфекциями");
            sgmDeseaseDictionary1.Add("Вирусный гепатит В", "Вирусным гепатитом В");
            sgmDeseaseDictionary1.Add("Вирусный гепатит С", "Вирусным гепатитом С");
            sgmDeseaseDictionary1.Add("Другие инфекционные заболевания (грипп, ОРЗ и др.)", "Другими инфекционными заболеваниями (гриппом, ОРЗ и др.)");
            sgmDeseaseDictionary1.Add("Бессимптомный инфекционный статус, вызванный вирусом иммунодефицита человека (ВИЧ)", "Бессимптомным инфекционным статусом, вызванным вирусом иммунодефицита человека (ВИЧ)");
            sgmDeseaseDictionary1.Add("Энтеровирусные инфекции", "Энтеровирусными инфекциями");
            sgmDeseaseDictionary1.Add("Энтеровирусный менингит", "Энтеровирусным менингитом");
            sgmDeseaseDictionary1.Add("Врожденная цитомегаловирусная инфекция", "Врожденной цитомегаловирусной инфекцией");
            sgmDeseaseDictionary1.Add("Криптоспоридиоз", "Криптоспоридиозом");
            sgmDeseaseDictionary1.Add("Гемофильная инфекция", "Гемофильной инфекцией");
            sgmDeseaseDictionary1.Add("Пневмонии", "Пневмонией");
            sgmDeseaseDictionary1.Add("Внутриутробные инфекции", "Внутриутробными инфекциями");
            sgmDeseaseDictionary1.Add("Другие острые вирусные гепатиты", "Другими острыми вирусными гепатитами");
            sgmDeseaseDictionary1.Add("Острые кишечные инфекции, вызванные установленными бактериальными возбудителями", "Острыми кишечными инфекциями, вызванными установленными бактериальными возбудителями");
            sgmDeseaseDictionary1.Add("Острые кишечные инфекции, вызванные кишечными  палочками (эшерихиями)", "Острыми кишечными инфекциями, вызванными кишечными  палочками (эшерихиями)");
            sgmDeseaseDictionary1.Add("Острые кишечные инфекции, вызванные вирусами", "Острыми кишечными инфекциями, вызванными вирусами");
            sgmDeseaseDictionary1.Add("Острые кишечные инфекции, вызванные вирусом  Норволк", "Острыми кишечными инфекциями, вызванными вирусом  Норволк");
            sgmDeseaseDictionary1.Add("Лихорадка Западного Нила", "Лихорадкой Западного Нила");
            sgmDeseaseDictionary1.Add("Крымская  геморрагическая лихорадка", "Крымской  геморрагической лихорадкой");
            sgmDeseaseDictionary1.Add("Малярия, вызванная Plasmodium falciparum", "Малярией, вызванной Plasmodium falciparum");
            sgmDeseaseDictionary1.Add("Амебиаз", "Амебиазом");
            sgmDeseaseDictionary1.Add("Клонохорз", "Клонохорзом");
            sgmDeseaseDictionary1.Add("Пневмония (внебольничная)", "Пневмонией (внебольничной)");

            // КБР
            sgmDeseaseDictionary1.Add("Острые вирусные гепатиты", "Острыми вирусными гепатитами");
            sgmDeseaseDictionary1.Add("Геморрагические лихорадки c почечным синдромом", "Геморрагическими лихорадками c почечным синдромом");
        }

        public void FillSGMDeseasesDictionary2()
        {
            sgmDeseaseDictionary2 = new Dictionary<string, string>();
            sgmDeseaseDictionary2.Clear();

            sgmDeseaseDictionary2.Add("Брюшной тиф", "Брюшного тифа");
            sgmDeseaseDictionary2.Add("Паратифы А, В, С  и неуточненный", "Паратифов А, В, С  и неуточненного");
            sgmDeseaseDictionary2.Add("Бактерионосители брюшного тифа, паратифов", "Бактерионосителей брюшного тифа, паратифов");
            sgmDeseaseDictionary2.Add("Холера", "Холеры");
            sgmDeseaseDictionary2.Add("Вибриононосители холеры", "Вибриононосителей холеры");
            sgmDeseaseDictionary2.Add("Другие сальмонеллезные инфекции", "Других сальмонеллезных инфекций");
            sgmDeseaseDictionary2.Add("Сальмонеллезные инфекции группы В", "Сальмонеллезных инфекций группы В");
            sgmDeseaseDictionary2.Add("Сальмонеллезные инфекции группы С", "Сальмонеллезных инфекций группы С");
            sgmDeseaseDictionary2.Add("Сальмонеллезные инфекции группы Д", "Сальмонеллезных инфекций группы Д");
            sgmDeseaseDictionary2.Add("Бактериальная дизентерия (шигеллез)", "Бактериальной дизентерии (шигеллеза)");
            sgmDeseaseDictionary2.Add("Дизентерия бактериологически подтвержденная", "Дизентерии бактериологически подтвержденной");
            sgmDeseaseDictionary2.Add("Дизентерия, вызванная шигеллами Зонне", "Дизентерии, вызванной шигеллами Зонне");
            sgmDeseaseDictionary2.Add("Дизентерия, вызванная шигеллами Флекснера", "Дизентерии, вызванной шигеллами Флекснера");
            sgmDeseaseDictionary2.Add("Бактерионосители дизентерии", "Бактерионосителей дизентерии");
            sgmDeseaseDictionary2.Add("Другие острые кишечные инфекции, вызванные установленными бактериальными, вирусными возбудителями, а также пищевые токсикоинфекции установленной этиологии", "Других острых кишечных инфекций, вызванных установленными бактериальными, вирусными возбудителями, а также пищевыми токсикоинфекциями установленной этиологии");
            sgmDeseaseDictionary2.Add("Острые кишечные инфекции, вызванные ротавирусами", "Острых кишечных инфекций, вызванных ротавирусами");
            sgmDeseaseDictionary2.Add("Острые кишечные инфекции, вызванные кампилобактериями", "Острых кишечных инфекций, вызванных кампилобактериями");
            sgmDeseaseDictionary2.Add("Острые кишечные инфекции, вызванные энтеропатогенными кишечными палочками", "Острых кишечных инфекций, вызванных энтеропатогенными кишечными палочками");
            sgmDeseaseDictionary2.Add("Острые кишечные инфекции, вызванные иерсиниями энтероколитика", "Острых кишечных инфекций, вызванных иерсиниями энтероколитика");
            sgmDeseaseDictionary2.Add("Острые кишечные инфекции, вызванные неустановленными инфекционными возбудителями, пищевые токсикоинфекции неустановленной этиологии", "Острых кишечных инфекций, вызванных неустановленными инфекционными возбудителями, пищевыми токсикоинфекциями неустановленной этиологии");
            sgmDeseaseDictionary2.Add("Острые вирусные гепатиты всего", "Острых вирусных гепатитов");
            sgmDeseaseDictionary2.Add("Острый гепатит А", "Острого гепатита А");
            sgmDeseaseDictionary2.Add("Острый гепатит В", "Острого гепатита В");
            sgmDeseaseDictionary2.Add("Острый гепатит С", "Острого гепатита С");
            sgmDeseaseDictionary2.Add("Хронические вирусные гепатиты (впервые установленные)", "Хронических вирусных гепатитов (впервые установленных)");
            sgmDeseaseDictionary2.Add("Хронический  вирусный гепатит В", "Хронического вирусного гепатита В");
            sgmDeseaseDictionary2.Add("Хронический вирусный гепатит С", "Хронического вирусного гепатита С");
            sgmDeseaseDictionary2.Add("Носительство возбудителя вирусного гепатита В", "Носительства возбудителя вирусного гепатита В");
            sgmDeseaseDictionary2.Add("Носительство возбудителя вирусного гепатита С", "Носительства возбудителя вирусного гепатита С");
            sgmDeseaseDictionary2.Add("Острый паралитический полиомиелит", "Острого паралитического полиомиелита");
            sgmDeseaseDictionary2.Add("Острый паралитический полиомиелит, вызванный диким вирусом", "Острого паралитического полиомиелита, вызванного диким вирусом");
            sgmDeseaseDictionary2.Add("Острый паралитический полиомиелит другой и неуточненный", "Острого паралитического полиомиелита неуточненного");
            sgmDeseaseDictionary2.Add("Острый паралитический полиомиелит, ассоциированный с вакциной", "Острого паралитического полиомиелита, ассоциированного с вакциной");
            sgmDeseaseDictionary2.Add("Острые вялые параличи", "Острых вялых параличей");
            sgmDeseaseDictionary2.Add("Дифтерия", "Дифтерии");
            sgmDeseaseDictionary2.Add("Бактерионосители токсигенных штаммов дифтерии", "Бактерионосителей токсигенных штаммов дифтерии");
            sgmDeseaseDictionary2.Add("Коклюш", "Коклюша");
            sgmDeseaseDictionary2.Add("Коклюш, вызванный Bordetella parapertussis", "Коклюша, вызванного Bordetella parapertussis");
            sgmDeseaseDictionary2.Add("Скарлатина", "Скарлатины");
            sgmDeseaseDictionary2.Add("Ветряная оспа", "Ветряной оспы");
            sgmDeseaseDictionary2.Add("Корь", "Кори");
            sgmDeseaseDictionary2.Add("Краснуха", "Краснухи");
            sgmDeseaseDictionary2.Add("Синдром врожденной краснухи (СВК)", "Синдрома врожденной краснухи (СВК)");
            sgmDeseaseDictionary2.Add("Паротит эпидемический", "Паротита эпидемического");
            sgmDeseaseDictionary2.Add("Менингококковая инфекция", "Менингококковой инфекции");
            sgmDeseaseDictionary2.Add("Менингококковая инфекция, генерализованные формы", "Менингококковой инфекции, генерализованной формы");
            sgmDeseaseDictionary2.Add("Столбняк", "Столбняка");
            sgmDeseaseDictionary2.Add("Туляремия", "Туляремиа");
            sgmDeseaseDictionary2.Add("Сибирская язва", "Сибирской язвы");
            sgmDeseaseDictionary2.Add("Бруцеллез, впервые выявленный", "Бруцеллеза, впервые выявленного");
            sgmDeseaseDictionary2.Add("Геморрагические лихорадки", "Геморрагической лихорадки");
            sgmDeseaseDictionary2.Add("Геморрагические лихорадки с почечным синдромом", "Геморрагической лихорадки с почечным синдромом");
            sgmDeseaseDictionary2.Add("Клещевой вирусный  энцефалит", "Клещевого вирусного энцефалита");
            sgmDeseaseDictionary2.Add("Клещевой боррелиоз (болезнь Лайма)", "Клещевого боррелиоза (болезнь Лайма)");
            sgmDeseaseDictionary2.Add("Псевдотуберкулез", "Псевдотуберкулеза");
            sgmDeseaseDictionary2.Add("Лептоспироз", "Лептоспироза");
            sgmDeseaseDictionary2.Add("Бешенство", "Бешенства");
            sgmDeseaseDictionary2.Add("Укусы, ослюнения, оцарапывания животными", "Укусов, ослюнений, оцарапываний животными");
            sgmDeseaseDictionary2.Add("Укусы, ослюнения, оцарапывания  дикими животными", "Укусов, ослюнений, оцарапываний  дикими животными");
            sgmDeseaseDictionary2.Add("Орнитоз (пситтакоз)", "Орнитоза (пситтакоз)");
            sgmDeseaseDictionary2.Add("Риккетсиозы", "Риккетсиозов");
            sgmDeseaseDictionary2.Add("Эпидемический сыпной тиф", "Эпидемического сыпного тифа");
            sgmDeseaseDictionary2.Add("Болезнь Брилля", "Болезни Брилля");
            sgmDeseaseDictionary2.Add("Лихорадка Ку", "Лихорадки Ку");
            sgmDeseaseDictionary2.Add("Сибирский клещевой тиф", "Сибирского клещевого тифа");
            sgmDeseaseDictionary2.Add("Педикулез", "Педикулеза");
            sgmDeseaseDictionary2.Add("Листериоз", "Листериоза");
            sgmDeseaseDictionary2.Add("Легионеллез", "Легионеллеза");
            sgmDeseaseDictionary2.Add("Инфекционный мононуклеоз", "Инфекционного мононуклеоза");
            sgmDeseaseDictionary2.Add("Туберкулез (впервые выявленный) активные формы", "Туберкулеза (впервые выявленного) активной формы");
            sgmDeseaseDictionary2.Add("Туберкулез органов дыхания", "Туберкулеза органов дыхания");
            sgmDeseaseDictionary2.Add("Туберкудез бациллярные формы", "Туберкудеза бациллярной формы");
            sgmDeseaseDictionary2.Add("Сифилис (впервые выявленный) все формы", "Сифилиса (впервые выявленного) всех форм");
            sgmDeseaseDictionary2.Add("Гонококковая  инфекция", "Гонококковой  инфекции");
            sgmDeseaseDictionary2.Add("Болезнь, вызванная вирусом иммуннодефицита человека", "Болезни, вызванной вирусом иммуннодефицита человека");
            sgmDeseaseDictionary2.Add("Острые инфекции верхних дыхательных путей множественной или неуточненной локализации", "Острых инфекций верхних дыхательных путей множественной или неуточненной локализации");
            sgmDeseaseDictionary2.Add("Грипп", "Гриппа");
            sgmDeseaseDictionary2.Add("Цитомегаловирусная инфекция", "Цитомегаловирусных инфекций");
            sgmDeseaseDictionary2.Add("Пневмоцистоз", "Пневмоцистоза");
            sgmDeseaseDictionary2.Add("Микроспория", "Микроспории");
            sgmDeseaseDictionary2.Add("Чесотка", "Чесотки");
            sgmDeseaseDictionary2.Add("Трихофития", "Трихофитии");
            sgmDeseaseDictionary2.Add("Малярия впервые выявленная", "Малярии впервые выявленной");
            sgmDeseaseDictionary2.Add("Паразитоносители малярии", "Паразитоносителей малярии");
            sgmDeseaseDictionary2.Add("Поствакцинальные осложнения", "Поствакцинальных осложнений");
            sgmDeseaseDictionary2.Add("Лямблиоз", "Лямблиоза");
            sgmDeseaseDictionary2.Add("Токсоплазмоз", "Токсоплазмоза");
            sgmDeseaseDictionary2.Add("Другие протозойные болезни", "Других протозойных болезней");
            sgmDeseaseDictionary2.Add("Аскаридоз", "Аскаридоза");
            sgmDeseaseDictionary2.Add("Трихоцефалез", "Трихоцефалеза");
            sgmDeseaseDictionary2.Add("Энтеробиоз", "Энтеробиоза");
            sgmDeseaseDictionary2.Add("Трихинеллез", "Трихинеллеза");
            sgmDeseaseDictionary2.Add("Токсокароз", "Токсокароза");
            sgmDeseaseDictionary2.Add("Тениаринхоз", "Тениаринхоза");
            sgmDeseaseDictionary2.Add("Тениоз", "Тениоза");
            sgmDeseaseDictionary2.Add("Гименолепидоз", "Гименолепидоза");
            sgmDeseaseDictionary2.Add("Дифиллоботриоз", "Дифиллоботриоза");
            sgmDeseaseDictionary2.Add("Эхиноккоз", "Эхиноккоза");
            sgmDeseaseDictionary2.Add("Описторхоз", "Описторхоза");
            sgmDeseaseDictionary2.Add("Другие гельминтозы", "Других гельминтозов");
            sgmDeseaseDictionary2.Add("Гнойно-септические инфекции новорожденных", "Гнойно-септических инфекций новорожденных");
            sgmDeseaseDictionary2.Add("Бактериальный менингит", "Бактериального менингита");
            sgmDeseaseDictionary2.Add("Сепсис", "Сепсиса");
            sgmDeseaseDictionary2.Add("Остеомиелит", "Остеомиелита");
            sgmDeseaseDictionary2.Add("Отит", "Отита");
            sgmDeseaseDictionary2.Add("Омфалит, флебит пупочной вены", "Омфалита, флебита пупочной вены");
            sgmDeseaseDictionary2.Add("Пиодермия, импетиго, мастит, панариций, паранихий", "Пиодермии, импетиго, мастита, панариция, паранихиния");
            sgmDeseaseDictionary2.Add("Конъюнктивит", "Конъюнктивита");
            sgmDeseaseDictionary2.Add("Гнойно-септические инфекции родильниц", "Гнойно-септических инфекций родильниц");
            sgmDeseaseDictionary2.Add("Мастит", "Мастита");
            sgmDeseaseDictionary2.Add("Послеоперационные инфекции", "Послеоперационных инфекций");
            sgmDeseaseDictionary2.Add("Постинъекционные инфекции", "Постинъекционных инфекций");
            sgmDeseaseDictionary2.Add("Инфекции мочевыводящих путей", "Инфекций мочевыводящих путей");
            sgmDeseaseDictionary2.Add("Острые кишечные инфекции", "Острых кишечных инфекций");
            sgmDeseaseDictionary2.Add("Вирусный гепатит В", "Вирусного гепатита В");
            sgmDeseaseDictionary2.Add("Вирусный гепатит С", "Вирусного гепатита С");
            sgmDeseaseDictionary2.Add("Другие инфекционные заболевания (грипп, ОРЗ и др.)", "Других инфекционных заболеваний (грипп, ОРЗ и др.)");
            sgmDeseaseDictionary2.Add("Бессимптомный инфекционный статус, вызванный вирусом иммунодефицита человека (ВИЧ)", "Бессимптомного инфекционного статуса, вызванного вирусом иммунодефицита человека (ВИЧ)");
            sgmDeseaseDictionary2.Add("Энтеровирусные инфекции", "Энтеровирусных инфекций");
            sgmDeseaseDictionary2.Add("Энтеровирусный менингит", "Энтеровирусного менингита");
            sgmDeseaseDictionary2.Add("Врожденная цитомегаловирусная инфекция", "Врожденной цитомегаловирусной инфекции");
            sgmDeseaseDictionary2.Add("Криптоспоридиоз", "Криптоспоридиоза");
            sgmDeseaseDictionary2.Add("Гемофильная инфекция", "Гемофильной инфекции");
            sgmDeseaseDictionary2.Add("Пневмонии", "Пневмонии");
            sgmDeseaseDictionary2.Add("Внутриутробные инфекции", "Внутриутробных инфекций");
            sgmDeseaseDictionary2.Add("Другие острые вирусные гепатиты", "Другими острых вирусных гепатитов");
            sgmDeseaseDictionary2.Add("Острые кишечные инфекции, вызванные установленными бактериальными возбудителями", "Острых кишечных инфекций, вызванных установленными бактериальными возбудителями");
            sgmDeseaseDictionary2.Add("Острые кишечные инфекции, вызванные кишечными  палочками (эшерихиями)", "Острых кишечных инфекций, вызванных кишечными  палочками (эшерихиями)");
            sgmDeseaseDictionary2.Add("Острые кишечные инфекции, вызванные вирусами", "Острых кишечных инфекций, вызванных вирусами");
            sgmDeseaseDictionary2.Add("Острые кишечные инфекции, вызванные вирусом  Норволк", "Острых кишечных инфекций, вызванных вирусом  Норволк");
            sgmDeseaseDictionary2.Add("Лихорадка Западного Нила", "Лихорадки Западного Нила");
            sgmDeseaseDictionary2.Add("Крымская  геморрагическая лихорадка", "Крымской  геморрагической лихорадки");
            sgmDeseaseDictionary2.Add("Малярия, вызванная Plasmodium falciparum", "Малярии, вызванной Plasmodium falciparum");
            sgmDeseaseDictionary2.Add("Амебиаз", "Амебиаза");
            sgmDeseaseDictionary2.Add("Клонохорз", "Клонохорза");
            sgmDeseaseDictionary2.Add("Пневмония (внебольничная)", "Пневмонией (внебольничной)");
        }

        #region Перевод наименования региона

        public Dictionary<string, string> fmtoSGMRegionsDictionary;

        public Dictionary<string, string> FmtoSGMRegionsDictionary
        {
            get
            {
                if (fmtoSGMRegionsDictionary == null || fmtoSGMRegionsDictionary.Count == 0)
                {
                    fmtoSGMRegionsDictionary = new Dictionary<string, string>();
                    FillFMtoSGMRegions();
                }
                return fmtoSGMRegionsDictionary;
            }
        }

        public string GetSGMName(string fmName)
        {
            if (FmtoSGMRegionsDictionary.ContainsValue(fmName))
            {
                foreach (string sgmName in fmtoSGMRegionsDictionary.Keys)
                {
                    if (FmtoSGMRegionsDictionary[sgmName] == fmName)
                    {
                        return sgmName;
                    }
                }
            }
            return fmName;
        }

        public string GetFMName(string sgmName)
        {
            if (FmtoSGMRegionsDictionary.ContainsKey(sgmName))
            {
                return FmtoSGMRegionsDictionary[sgmName];
            }
            return sgmName;
        }

        public void FillFMtoSGMRegions()
        {                
            fmtoSGMRegionsDictionary = new Dictionary<string, string>();
            fmtoSGMRegionsDictionary.Clear();
            fmtoSGMRegionsDictionary.Add("РОССИЙСКАЯ ФЕДЕРАЦ. ", "Российская  Федерация");

            fmtoSGMRegionsDictionary.Add("ЦЕНТРАЛЬНЫЙ ФЕД.ОКР.", "Центральный федеральный округ");
            fmtoSGMRegionsDictionary.Add("Белгородская обл    ", "Белгородская область");
            fmtoSGMRegionsDictionary.Add("Брянская область    ", "Брянская область");
            fmtoSGMRegionsDictionary.Add("Владимирская обл    ", "Владимирская область");
            fmtoSGMRegionsDictionary.Add("Воронежская обл.    ", "Воронежская область");
            fmtoSGMRegionsDictionary.Add("г.Москва            ", "г. Москва");
            fmtoSGMRegionsDictionary.Add("Ивановская обл.     ", "Ивановская область");
            fmtoSGMRegionsDictionary.Add("Калужская обл.      ", "Калужская область");
            fmtoSGMRegionsDictionary.Add("Костромская обл.    ", "Костромская область");
            fmtoSGMRegionsDictionary.Add("Курская область     ", "Курская область");
            fmtoSGMRegionsDictionary.Add("Липецкая область    ", "Липецкая область");
            fmtoSGMRegionsDictionary.Add("Московская обл.     ", "Московская область");
            fmtoSGMRegionsDictionary.Add("Орловская обл.      ", "Орловская область");
            fmtoSGMRegionsDictionary.Add("Рязанская обл.      ", "Рязанская область");
            fmtoSGMRegionsDictionary.Add("Смоленская обл.     ", "Смоленская область");
            fmtoSGMRegionsDictionary.Add("Тверская область    ", "Тверская область");
            fmtoSGMRegionsDictionary.Add("Тульская область    ", "Тульская область");
            fmtoSGMRegionsDictionary.Add("Ярославская обл.    ", "Ярославская область");
            fmtoSGMRegionsDictionary.Add("Тамбовская обл.     ", "Тамбовская область");

            fmtoSGMRegionsDictionary.Add("УРАЛЬСКИЙ ФЕД.ОКРУГ ", "Уральский федеральный округ");
            fmtoSGMRegionsDictionary.Add("Курганская обл.     ", "Курганская область");
            fmtoSGMRegionsDictionary.Add("Свердловская обл    ", "Свердловская область");
            fmtoSGMRegionsDictionary.Add("Тюменская обл.      ", "Тюменская область");
            fmtoSGMRegionsDictionary.Add("Ханты-МансийскАО    ", "Ханты-Мансийский автономный округ");
            fmtoSGMRegionsDictionary.Add("Ямало-НенецкийАО    ", "Ямало-Ненецкий автономный округ");
            fmtoSGMRegionsDictionary.Add("Челябинская обл.    ", "Челябинская область");

            fmtoSGMRegionsDictionary.Add("ДАЛЬНЕВОСТ.ФЕД.ОКРУГ", "Дальневосточный федеральный округ");
            fmtoSGMRegionsDictionary.Add("Амурская область    ", "Амурская область");
            fmtoSGMRegionsDictionary.Add("Еврейская АО        ", "Еврейская автономная область");
            fmtoSGMRegionsDictionary.Add("Камчатская обл.     ", "Камчатская область");
            fmtoSGMRegionsDictionary.Add("Камчатский край     ", "Камчатский край");
            fmtoSGMRegionsDictionary.Add("Корякский АО        ", "Корякский автономный округ");
            fmtoSGMRegionsDictionary.Add("Магаданская обл.    ", "Магаданская область");
            fmtoSGMRegionsDictionary.Add("Приморский край     ", "Приморский край");
            fmtoSGMRegionsDictionary.Add("Республика Саха     ", "Республика Саха (Якутия)");
            fmtoSGMRegionsDictionary.Add("Сахалинская обл.    ", "Сахалинская область");
            fmtoSGMRegionsDictionary.Add("Хабаровский край    ", "Хабаровский край");
            fmtoSGMRegionsDictionary.Add("Чукотский АО        ", "Чукотский автономный округ");

            fmtoSGMRegionsDictionary.Add("СИБИРСКИЙ ФЕД.ОКРУГ ", "Сибирский федеральный округ");
            fmtoSGMRegionsDictionary.Add("Агин.БурятскийАО    ", "Агин.Бурятский автономный округ");
            fmtoSGMRegionsDictionary.Add("Алтайский край      ", "Алтайский край");
            fmtoSGMRegionsDictionary.Add("Забайкальский край  ", "Забайкальский край");
            fmtoSGMRegionsDictionary.Add("Иркутская обл.      ", "Иркутская область");
            fmtoSGMRegionsDictionary.Add("Кемеровская обл.    ", "Кемеровская область");
            fmtoSGMRegionsDictionary.Add("Красноярский кр.    ", "Красноярский край");
            fmtoSGMRegionsDictionary.Add("Новосибирская об    ", "Новосибирская область");
            fmtoSGMRegionsDictionary.Add("Омская область      ", "Омская область");
            fmtoSGMRegionsDictionary.Add("Республика Алтай    ", "Республика Алтай");
            fmtoSGMRegionsDictionary.Add("Респ.Бурятия        ", "Республика Бурятия");
            fmtoSGMRegionsDictionary.Add("Республика Тыва     ", "Республика Тыва");
            fmtoSGMRegionsDictionary.Add("Респ.Хакасия        ", "Республика Хакасия");
            fmtoSGMRegionsDictionary.Add("Таймырский АО       ", "Таймырский автономный округ");
            fmtoSGMRegionsDictionary.Add("Томская область     ", "Томская область");
            fmtoSGMRegionsDictionary.Add("Усть-Орд-БурятАО    ", "Усть-Ордынский Бурятский автономный округ");
            fmtoSGMRegionsDictionary.Add("Читинская обл.      ", "Читинская область");
            fmtoSGMRegionsDictionary.Add("Эвенкийский АО      ", "Эвенкийский автономный округ");

            fmtoSGMRegionsDictionary.Add("СЕВЕРО-ЗАПАДНЫЙ ФО  ", "Северо-Западный федеральный округ");
            fmtoSGMRegionsDictionary.Add("Архангельская обл.  ", "Архангельская область");
            fmtoSGMRegionsDictionary.Add("Вологодская область ", "Вологодская область");
            fmtoSGMRegionsDictionary.Add("Санкт-Петербург     ", "г. Санкт-Петербург");
            fmtoSGMRegionsDictionary.Add("Калининград.обл.    ", "Калининградская область");
            fmtoSGMRegionsDictionary.Add("Ленинградская обл.  ", "Ленинградская область");
            fmtoSGMRegionsDictionary.Add("Мурманская область  ", "Мурманская область");
            fmtoSGMRegionsDictionary.Add("Ненецкий авт.окр    ", "Ненецкий автономный округ");
            fmtoSGMRegionsDictionary.Add("Новгородская обл    ", "Новгородская область");
            fmtoSGMRegionsDictionary.Add("Псковская область   ", "Псковская область");
            fmtoSGMRegionsDictionary.Add("Республика Карелия  ", "Республика Карелия");
            fmtoSGMRegionsDictionary.Add("Республика Коми     ", "Республика Коми");

            fmtoSGMRegionsDictionary.Add("ЮЖНЫЙ ФЕД. ОКР      ", "Южный федеральный округ");
            fmtoSGMRegionsDictionary.Add("Астраханская обл    ", "Астраханская область");
            fmtoSGMRegionsDictionary.Add("Волгоградская об    ", "Волгоградская область");
            fmtoSGMRegionsDictionary.Add("Кабард.-Балкар.Респ.", "Кабардино-Балкарская Республика");
            fmtoSGMRegionsDictionary.Add("Карач.-Черк.Респ    ", "Карачаево-Черкесская Республика");
            fmtoSGMRegionsDictionary.Add("Краснодарский кр    ", "Краснодарский край");
            fmtoSGMRegionsDictionary.Add("Респ.Адыгея         ", "Республика Адыгея (Адыгея)");
            fmtoSGMRegionsDictionary.Add("Респ.Дагестан       ", "Республика Дагестан");
            fmtoSGMRegionsDictionary.Add("Респ.Ингушетия      ", "Республика Ингушетия");
            fmtoSGMRegionsDictionary.Add("Респ.Калмыкия       ", "Республика Калмыкия");
            fmtoSGMRegionsDictionary.Add("Респ.Сев.-Осетия    ", "Республика Северная Осетия-Алания");
            fmtoSGMRegionsDictionary.Add("Ростовская обл.     ", "Ростовская область");
            fmtoSGMRegionsDictionary.Add("Ставропольск.кр.    ", "Ставропольский край");
            fmtoSGMRegionsDictionary.Add("Чеченская Респ.     ", "Чеченская республика");

            fmtoSGMRegionsDictionary.Add("ПРИВОЛЖСКИЙ ФЕД.ОКР.", "Приволжский федеральный округ");
            fmtoSGMRegionsDictionary.Add("Кировская обл.      ", "Кировская область");
            fmtoSGMRegionsDictionary.Add("Коми-ПермяцкийАО    ", "Коми-Пермяцкий автономный округ");
            fmtoSGMRegionsDictionary.Add("Нижегородская об    ", "Нижегородская область");
            fmtoSGMRegionsDictionary.Add("Оренбургская обл    ", "Оренбургская область");
            fmtoSGMRegionsDictionary.Add("Пензенская обл.     ", "Пензенская область");
            fmtoSGMRegionsDictionary.Add("Пермская область    ", "Пермская область");
            fmtoSGMRegionsDictionary.Add("Пермский край       ", "Пермский край");
            fmtoSGMRegionsDictionary.Add("Рес.Башкортостан    ", "Республика Башкортостан");
            fmtoSGMRegionsDictionary.Add("Респ.Марий Эл       ", "Республика Марий Эл");
            fmtoSGMRegionsDictionary.Add("Респ.Мордовия       ", "Республика Мордовия");
            fmtoSGMRegionsDictionary.Add("Респ.Татарстан      ", "Республика Татарстан (Татарстан)");
            fmtoSGMRegionsDictionary.Add("Самарская обл.      ", "Самарская область");
            fmtoSGMRegionsDictionary.Add("Саратовская обл.    ", "Саратовская область");
            fmtoSGMRegionsDictionary.Add("Удмуртская Респ.    ", "Удмуртская республика");
            fmtoSGMRegionsDictionary.Add("Ульяновская обл.    ", "Ульяновская область");
            fmtoSGMRegionsDictionary.Add("Чувашская Респ.     ", "Чувашская Республика-Чувашия");

            fmtoSGMRegionsDictionary.Add("СЕВЕРО-КАВКАЗСКИЙ ФО", "Северо-Кавказский федеральный округ");
        }

        #endregion
    }
}