/*******************************************************************
 Переводит базу Sql Server 2005 из версии 2.3.1 в следующую версию 2.X.X
*******************************************************************/

/* Шаблон оформления альтера: */
/* Start - <Номер задачи в ClearQuest> - <Суть задачи> - <Фамилия> - <Дата: DD.MM.YYYY> */
    /* Ваш SQL-скрипт */
/* End   - <Номер задачи в ClearQuest> - <Суть задачи> - <Фамилия> - <Дата: DD.MM.YYYY> */

/* Start - 7699 - Архивирование протоколов  - blinkov - 27.02.2008 */

insert into KindsOfEvents (ID, ClassOfEvent, Name) 
values (40701, 5, 'Архивирование протоколов');

go

insert into DatabaseVersions (ID, Name, Released, Updated, Comments, NeedUpdate)
values (40, '2.4.0.6', CONVERT(datetime, '2008.02.27', 102), GETDATE(), 'Архивирование протоколов', 0);

go

/* End - 7699 - Архивирование протоколов  - blinkov - 27.02.2008 */

