using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using Krista.FM.Client.Reports.Common.Commands;

namespace Krista.FM.Client.Reports.EGRIP.Commands
{
    [Description("ReportUFKMO0012")]
    public class ReportEGRIP0002Command : ExcelMacrosCommand
    {
        public ReportEGRIP0002Command()
        {
            key = "ReportUFKMO0012";
            caption = "Выбор организаций по показателям";
        }

        public override void CreateReportParams()
        {
            paramBuilder.AddListParam(ReportConsts.ParamReportList)
                .SetCaption("Разделы информации")
                .Values = new List<object>
                               {
                                   "ОГРНИП",
                                   "ИНН",
                                   "ФИО",
                                   "Дата записи о ФИО",
                                   "ФИО латинскими буквами",
                                   "Пол",
                                   "Дата записи об адресе",
                                   "Адрес",
                                   "ОКАТО",
                                   "Контактная информация ",
                                   "Вид деятельности",
                                   "Сведения о статусе",
                                   "Регистрирующий орган",
                                   "Сведения о старой регистрации",
                                   "Основной ОКВЭД",
                                   "Дата записи о документе удостоверяющем личность",
                                   "Документ удостоверяющий личность",
                                   "Серия и номер документа ",
                                   "Дата выдачи документа",
                                   "Орган выдавший документ",
                                   "Код подразделения выдавшего документ",
                                   "Дата записи о гражданстве",
                                   "Вид гражданства",
                                   "Страна гражданства",
                                   "Дата записи о документе подтверждающем право проживания в РФ",
                                   "Документ дающий право на проживание в РФ",
                                   "Номер документа",
                                   "Дата выдачи документа ",
                                   "Орган выдавший документ",
                                   "Дата окончания действия документа",
                                   "Дата внесения записи о дееспособности ",
                                   "Документ подтверждающий приобретение дееспособности",
                                   "Номер документа",
                                   "Орган выдавший документ",
                                   "Дата документа",
                                   "Документ основание приобретения дееспособности",
                                   "Дата постановки на учет в налоговом органе",
                                   "Дата снятия с учета",
                                   "Наименование налогового органа",
                                   "Регномер ПФ",
                                   "Дата регистрации",
                                   "Дата снятия с учета",
                                   "Наименование территориального органа ПФ",
                                   "Регномер ФСС",
                                   "Дата регистрации",
                                   "Дата снятия с учета",
                                   "Наименование исполнительного органа ФСС",
                                   "Регномер ФОМС",
                                   "Дата регистрации",
                                   "Дата снятия с учета",
                                   "Наименование территориального ФОМС"
                               };
        }

        public override DataTable[] GetReportData(Dictionary<string, string> reportParams)
        {
            return reportServer.GetEGRIP0002ReportData(reportParams);
        }
    }
}
