unit uAdminToolsConsts;

interface

uses brs_GeneralFunctions;

const
  MonthByNumber: array[0..12] of string = (
    'Начало года',
    'Январь',
    'Февраль',
    'Март',
    'Апрель',
    'Май',
    'Июнь',
    'Июль',
    'Август',
    'Сентябрь',
    'Октябрь',
    'Ноябрь',
    'Декабрь');

  DeclMonthByNumber: array[1..12] of string = (
    'Января',
    'Февраля',
    'Марта',
    'Апреля',
    'Мая',
    'Июня',
    'Июля',
    'Августа',
    'Сентября',
    'Октября',
    'Ноября',
    'Декабря');

////////////////////////////////////////////////////////////////////////////////
////////////////////////////  Данные реестра  //////////////////////////////////
////////////////////////////////////////////////////////////////////////////////

  // Путь к настройкам
  // Потом удалить
//  RegistryPath = '\SOFTWARE\krista\FM\AdminTools\DataPump';
  DataBaseRegValue = 'Database';
  // Путь к базе АС ФМ
  DatabaseRegKey = 'Database';

////////////////////////////////////////////////////////////////////////////////
/////////////////////////  Файлы исходных данных  //////////////////////////////
////////////////////////////////////////////////////////////////////////////////

//  PumpSubjectsFileName             = 'PumpSubjects.xml'; // Файл операций закачки
//  MonthlyReportingSettingsFileName = 'BudgetMonthRepSettings.xml'; // Файл исходных данных для ежемесячной отчетности
  BridgeTablesFileName             = 'BridgeTables.xml'; // Файл сопоставления классификаторов
  TablesDescrFileName              = 'TablesDescription.xml'; // Файл хранения настроек отображения полей в гриде
//  ArbitraryReportsFileName         = 'ArbitraryReportList.xml'; // Файл списка произвольных отчетов
//  ServiceIntfFileName              = 'ServiceInterfaces.xml'; // Файл описания интерфейсов
//  MapFileName                      = 'DataPump_Exchange'; // Oбъект отображения

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////  Scheduler  ///////////////////////////////////
////////////////////////////////////////////////////////////////////////////////

  SchedulerTaskDir = 'AdminJobs\';

const GroupsTag = 'MMCParamsGroups';
      GroupTag  = 'MMCParamsGroup';
      ParamTag  = 'MMCParam';
      NameTag   = 'Name';
      ValueTag  = 'Value';

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////  TXTSorcerer  /////////////////////////////////
////////////////////////////////////////////////////////////////////////////////

  // Путь к каталогу с хмл-файлами параметров текстовых отчетов
  TXTReportSettingsDir = 'TXTReportSettings\';

implementation

end.
