//------------------------------------------------------------------------------
// <автоматически создаваемое>
//     Этот код создан программой.
//
//     Изменения в этом файле могут привести к неправильной работе и будут потеряны в случае
//     повторной генерации кода. 
// </автоматически создаваемое>
//------------------------------------------------------------------------------

namespace Krista.FM.Server.Dashboards.reports.iPad {
    
    
    public partial class Oil_0004_0001 {
        
        /// <summary>
        /// form1 элемент управления.
        /// </summary>
        /// <remarks>
        /// Автоматически создаваемое поле.
        /// Для изменения переместите объявление поля из файла конструктора в файл кода программной части.
        /// </remarks>
        protected global::System.Web.UI.HtmlControls.HtmlForm form1;
        
        /// <summary>
        /// OIL_0004_0001_Text2 элемент управления.
        /// </summary>
        /// <remarks>
        /// Автоматически создаваемое поле.
        /// Для изменения переместите объявление поля из файла конструктора в файл кода программной части.
        /// </remarks>
        protected global::Krista.FM.Server.Dashboards.reports.Dashboard.OIL_0004_0001_Text OIL_0004_0001_Text2;
        
        /// <summary>
        /// OIL_0004_0001_Text3 элемент управления.
        /// </summary>
        /// <remarks>
        /// Автоматически создаваемое поле.
        /// Для изменения переместите объявление поля из файла конструктора в файл кода программной части.
        /// </remarks>
        protected global::Krista.FM.Server.Dashboards.reports.Dashboard.OIL_0004_0001_Text OIL_0004_0001_Text3;
        
        /// <summary>
        /// OIL_0004_0001_Text4 элемент управления.
        /// </summary>
        /// <remarks>
        /// Автоматически создаваемое поле.
        /// Для изменения переместите объявление поля из файла конструктора в файл кода программной части.
        /// </remarks>
        protected global::Krista.FM.Server.Dashboards.reports.Dashboard.OIL_0004_0001_Text OIL_0004_0001_Text4;
    }
}
